import numpy as np


# ====== ПАРАМЕТРЫ МОДЕЛИ ======
# =====================================

N = 10000 # КОЛИЧЕСТВО ОТСЧЁТОВ
FS = 8800 # ЧАСТОТА ДИСКРЕТИЗАЦИИ
DT = 1/FS # ШАГ ДИСКРЕТИЗАЦИИ
GLOBAL_SEED = 11 # НАЧАЛЬНОЕ СОСТОЯНИЕ ГЕНЕРАТОРА СЛУЧАЙНЫХ ЧИСЕЛ

DURATION_ALL = (N-1)*DT # ДЛИТЕЛЬНОСТЬ ИМПУЛЬСА
SPEED_ON_SOUND = 343.26 # СКОРОСТЬ ЗВУКА


# ====== ПАРАМЕТРЫ КОНФИГУРАЦИИИ ======
# =====================================

REALISATION_COUNT = 10 # КОЛИЧЕСТВО РЕАЛИЗАЦИЙ ШУМА
M = 3 # КОЛИЧЕСТВО ДАТЧИКОВ
SNR = 2 # ОТНОШЕНИЕ СИГНАЛ/ШУМ 
BETTA_PULSE = 0.02 # ДЛИТЕЛЬНОСТЬ ИМПУЛЬСНОГО СИГНАЛА 
F_GARMONIC = 10 # ЦЕНТРАЛЬНАЯ ЧАСТОТА ГАРМОНИЧЕСКОГО СИГНАЛА 
CENTER_PULSE = DURATION_ALL/2 # Центр импульсного сигнала 
A = 1 # АМПЛИТУДА СИГНАЛА 
ALPHA = 10
ALPHA_RMS = 10
PHI_STEP = 0.001 # Шаг поиска угла 0.0003
K = 0.5 # коэффицент для полосы решетки 

R = SPEED_ON_SOUND / (2*F_GARMONIC*ALPHA) # РАДИУС РЕШЕТКИ АВП
TARGET_PHI = np.pi/4 # АЗИМУТ ПОД КОТОРЫМ ПРИХОДИТ ИСГНАЛ (ТО ЧТО ОЦЕНИВАЕМ)
AMOUNT_PHI = int(2*np.pi/PHI_STEP) # Количество значений угла 
CONST_RADIAN = (np.pi/180)**2


